OlioAppRails/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    render json: Product.with_attached_image_url.all

INSERT INTO "products" ("region", "location", "name", "image_url", "description", "price", "organic", "flavored", "forcooking", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product= Product.create!(product_params)

UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2023-01-24 06:06:47.431754"], ["id", 2]]
---
  def update
    product= find_product
    product.update!(product_params)