OlioAppRails/app/controllers/reviews_controller.rb

    def show
        render json: Product.find(params[:id]).reviews
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 4]]