OlioAppRails/app/controllers/sessions_controller.rb

    def create
        user = User.find_by(email: params[:email], account_type: params[:account_type])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."account_type" = ? LIMIT ?  [["email", "jacob@gmail.com"], ["account_type", "user"], ["LIMIT", 1]]